       PROCEDURE DIVISION USING LINKAGE-PARMS.                          01050000
                                                        
           MOVE '1' TO SPOOLR-ASA.                                      01120600
           MOVE SPACES TO SPOOLR-TEXT.                                  01120610
                                                                        01120620