       01  STRUCT.
         05  NAME             PIC X(30).
         05  BIRTH-DATE.      
             10 DATE-YEAR          PIC 9(4) VALUE '2020'. 
             10 DATE-MONTH         PIC 9(2).
             10 DATE-DAY           PIC 9(2).
